# import pandas as pd      y=m*x+c        Y=f(x)   Y is dependent variable  x is independent variable y=price   and x=area       price=m*area+c

In [ ]:
#price = m*area+ m*bedrooms+ m*age +c


#price=m(area+bedrooms+age)+c





y=mx+c 
y=price
x=area

In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [2]:
df=pd.read_csv("D:\\homeprices.csv")
df

    area  bedrooms  age   price
0   2600       3.0   20  550000
1   3000       4.0   15  565000
2   3200       NaN   18  610000
3   3600       3.0   30  595000
4   4000       NaN    8  760000
5   4100       6.0    8  810000
6   5342       4.0    6  768450
7  45367       5.0    9  854554

In [3]:
df.bedrooms.median()

4.0

In [4]:
df.bedrooms=df.bedrooms.fillna(4)#missing value tritment

In [5]:
df

    area  bedrooms  age   price
0   2600       3.0   20  550000
1   3000       4.0   15  565000
2   3200       4.0   18  610000
3   3600       3.0   30  595000
4   4000       4.0    8  760000
5   4100       6.0    8  810000
6   5342       4.0    6  768450
7  45367       5.0    9  854554

In [40]:
X=df.drop("price",axis="columns")
new_df

    area  bedrooms  age
0   2600       3.0   20
1   3000       4.0   15
2   3200       4.0   18
3   3600       3.0   30
4   4000       4.0    8
5   4100       6.0    8
6   5342       4.0    6
7  45367       5.0    9

In [6]:
new_df1=df.iloc[   :   ,   [0,1,2]   ]
new_df1

    area  bedrooms  age
0   2600       3.0   20
1   3000       4.0   15
2   3200       4.0   18
3   3600       3.0   30
4   4000       4.0    8
5   4100       6.0    8
6   5342       4.0    6
7  45367       5.0    9

In [7]:
new_price=df.iloc[:,3]
new_price

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
6    768450
7    854554
Name: price, dtype: int64

In [41]:
Y=df.price
new_price

    price
0  550000
1  565000
2  610000
3  595000
4  760000
5  810000
6  768450
7  854554

In [9]:
new_price=df.drop(["area","bedrooms","age"],axis="columns")
new_price

    price
0  550000
1  565000
2  610000
3  595000
4  760000
5  810000
6  768450
7  854554

LinearRegression()

array([[830759.6492181]])

In [12]:
df.corr()#this method shows the co - relation among feature

              area  bedrooms       age     price
area      1.000000  0.375714 -0.291910  0.588549
bedrooms  0.375714  1.000000 -0.690853  0.760404
age      -0.291910 -0.690853  1.000000 -0.774948
price     0.588549  0.760404 -0.774948  1.000000

In [18]:
from sklearn.model_selection import train_test_split

In [35]:
X_train, X_test, y_train, y_test = train_test_split(X,Y,test_size=0.33, random_state=1)

In [36]:
X_train

   area  bedrooms  age
6  5342       4.0    6
0  2600       3.0   20
4  4000       4.0    8
3  3600       3.0   30
5  4100       6.0    8

In [37]:
 X_test

    area  bedrooms  age
7  45367       5.0    9
2   3200       4.0   18
1   3000       4.0   15

In [38]:
y_train

    price
6  768450
0  550000
4  760000
3  595000
5  810000

In [39]:
y_test

    price
7  854554
2  610000
1  565000

In [42]:
model=linear_model.LinearRegression()
model.fit(X_train,y_train)

LinearRegression()

In [44]:
model.predict([[3456,10,25]])

array([[910304.05877043]])